In [1]:
import pandas as pd

In [2]:
data = pd.read_excel("strategy_results_train.xlsx")

In [3]:
data.head()

,id,label,date,open,high,low,close,volume,kama5,kama10,kama15
0,SHSE.600085_201501,0,2014-12-30,20.900000,22.090000,20.799999,22.049999,25457468.0,21.646666,21.445000,21.747499
1,SHSE.600085_201502,1,2015-01-30,22.990000,23.190001,22.510000,22.580000,7880595.0,22.760000,22.850000,22.715000
2,SHSE.600085_201503,1,2015-02-27,22.520000,22.670000,22.400000,22.540001,9263796.0,22.536667,22.535000,22.537500
3,SHSE.600085_201504,1,2015-03-30,26.219999,26.440001,25.820000,26.230000,16125626.0,26.163333,26.130000,26.180000
4,SHSE.600085_201505,1,2015-04-29,32.580002,33.639999,32.279999,33.180000,13959795.0,33.033333,32.959999,33.070000

In [4]:
data2 = pd.concat( [data.iloc[:, 1], data.iloc[:, 8:]], axis=1)

In [5]:
data2.head()

   label      kama5     kama10     kama15
0      0  21.646666  21.445000  21.747499
1      1  22.760000  22.850000  22.715000
2      1  22.536667  22.535000  22.537500
3      1  26.163333  26.130000  26.180000
4      1  33.033333  32.959999  33.070000

In [6]:
data2.isnull().any()

label     False
kama5     False
kama10    False
kama15    False
dtype: bool

In [7]:
data2 = data2.dropna(axis = 0)
data2.isnull().any()

label     False
kama5     False
kama10    False
kama15    False
dtype: bool

In [8]:
y = data2["label"]
y

0        0
1        1
2        1
3        1
4        1
        ..
31942    1
31943    0
31944    0
31945    0
31946    0
Name: label, Length: 31947, dtype: int64

In [9]:
X = data2.iloc[:, 1:]

In [10]:
X

           kama5     kama10     kama15
0      21.646666  21.445000  21.747499
1      22.760000  22.850000  22.715000
2      22.536667  22.535000  22.537500
3      26.163333  26.130000  26.180000
4      33.033333  32.959999  33.070000
...          ...        ...        ...
31942  57.363333  57.305000  57.392500
31943  54.826667  54.865000  54.807500
31944  56.726667  56.365000  56.907500
31945  45.573334  45.245001  45.737500
31946  48.233334  48.445000  48.127501

[31947 rows x 3 columns]

In [11]:
X = X.dropna(axis = 0)

In [12]:
X.isnull().any()

kama5     False
kama10    False
kama15    False
dtype: bool

In [13]:
X.shape

(31947, 3)

In [14]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier()
clf.fit(X, y)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [15]:
testdata = pd.read_excel("sampleSubmission.xlsx")

In [16]:
testdata = testdata.fillna(0)
testdata.isnull().any()

id        False
label     False
kama5     False
kama10    False
kama15    False
dtype: bool

In [17]:
testdata.iloc[:, 2:]

           kama5     kama10     kama15
0      27.356667  27.285000  27.392500
1      26.506666  26.525000  26.497499
2      29.296666  29.370000  29.260000
3      29.646667  29.505000  29.717500
4      31.036666  31.030000  31.039999
...          ...        ...        ...
11358  83.633334  83.650002  83.625000
11359  76.340001  76.290001  76.365002
11360  71.866666  71.549999  72.025000
11361  83.949999  84.424999  83.712500
11362  81.316666  81.125000  81.412498

[11363 rows x 3 columns]

In [18]:
lt = clf.predict(testdata.iloc[:, 2:])

In [21]:
result = clf.predict(testdata.iloc[:, 2:])

In [22]:
pd.DataFrame(result).to_excel("prediction.xlsx", index=False)